/**
 * created by 江心才子, 2020/3/5
 * Copyright (c) 2020, 270628297@qq.com All Rights Reserved.
 * #                   *********                            #
 * #                  ************                          #
 * #                  *************                         #
 * #                 **  ***********                        #
 * #                ***  ****** *****                       #
 * #                *** *******   ****                      #
 * #               ***  ********** ****                     #
 * #              ****  *********** ****                    #
 * #            *****   ***********  *****                  #
 * #           ******   *** ********   *****                #
 * #           *****   ***   ********   ******              #
 * #          ******   ***  ***********   ******            #
 * #         ******   **** **************  ******           #
 * #        *******  ********************* *******          #
 * #        *******  ******************************         #
 * #       *******  ****** ***************** *******        #
 * #       *******  ****** ****** *********   ******        #
 * #       *******    **  ******   ******     ******        #
 * #       *******        ******    *****     *****         #
 * #        ******        *****     *****     ****          #
 * #         *****        ****      *****     ***           #
 * #          *****       ***        ***      *             #
 * #            **       ****        ****                   #
 */
package main.kt.day29_practice1

import kotlin.browser.document
import kotlin.browser.window

/**
 * 项目名称：03JavaScript
 * 创建人：江心才子
 * 创建时间：2020-03-05 16:14
 * 内容描述：
 * 修改说明：
 */

/*fun main() {
//    val a = 123
//    window.alert(a.toString())
//    val b = "abc"
//    window.alert(b)

    val num = 1
    val num2 = 1.2
    val num3 = 3.0

    document.writeln("$num<br>")
    document.writeln("$num2<br>")
    document.writeln("${num/num3}<br>")

    fun adb(){
        document.writeln("adb <br>")
    }

    adb()
}*/

