/**
 * created by 江心才子, 2020/3/5
 * Copyright (c) 2020, 270628297@qq.com All Rights Reserved.
 * #                   *********                            #
 * #                  ************                          #
 * #                  *************                         #
 * #                 **  ***********                        #
 * #                ***  ****** *****                       #
 * #                *** *******   ****                      #
 * #               ***  ********** ****                     #
 * #              ****  *********** ****                    #
 * #            *****   ***********  *****                  #
 * #           ******   *** ********   *****                #
 * #           *****   ***   ********   ******              #
 * #          ******   ***  ***********   ******            #
 * #         ******   **** **************  ******           #
 * #        *******  ********************* *******          #
 * #        *******  ******************************         #
 * #       *******  ****** ***************** *******        #
 * #       *******  ****** ****** *********   ******        #
 * #       *******    **  ******   ******     ******        #
 * #       *******        ******    *****     *****         #
 * #        ******        *****     *****     ****          #
 * #         *****        ****      *****     ***           #
 * #          *****       ***        ***      *             #
 * #            **       ****        ****                   #
 */
package day29_practice1

import kotlin.browser.document
import kotlin.js.Date

/**
 * 项目名称：03JavaScript
 * 创建人：江心才子
 * 创建时间：2020-03-05 17:52
 * 内容描述：
 * 修改说明：
 */
//fun main() {
//    val date = Date()
//    document.write("${date.toLocaleString()} 3 <br/>")
//    document.write("${date.getTime()} 6 <br/>")
//
//    document.write("$date 1 <br/>")
//    document.write("${date.toDateString()} 2 <br/>")
//    document.write("${date.toLocaleDateString()} 4 <br/>")
//    document.write("${date.toLocaleTimeString()} 5 <br/>")
//
//    /*
//    2020/3/6 上午9:16:49 3
//    1583457409238 6
//    Fri Mar 06 2020 09:16:49 GMT+0800 (中国标准时间) 1
//    Fri Mar 06 2020 2
//    2020/3/6 4
//    上午9:16:49 5
//     */
//}